In [1]:
### 기계공학과 4학년
### 20154523 강남규

## 계산 및 함수의 적용 예 (1)

In [2]:
import numpy as np
from pandas import Series, DataFrame

df = DataFrame([[1.4, np.nan], [7.1, -4.5],
               [np.nan, np.nan], [0.75, -1.3]],
              index = ['a', 'b', 'c', 'd'],
              columns = ['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [3]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [4]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [5]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [6]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

## 계산 및 함수의 적용 예 (2)

In [8]:
frame = DataFrame(np.random.randn(4,3),
                 columns = list('bde'),
                 index=['Utah','Ohio','Texas','Oregon'])
frame

               b         d         e
Utah    0.699870  0.436695 -1.283090
Ohio    1.813865  0.571423  0.431563
Texas  -0.397820 -0.677725 -1.261581
Oregon  0.114520  1.274939 -0.981232

In [9]:
np.abs(frame)

               b         d         e
Utah    0.699870  0.436695  1.283090
Ohio    1.813865  0.571423  0.431563
Texas   0.397820  0.677725  1.261581
Oregon  0.114520  1.274939  0.981232

In [11]:
f = lambda x : x.max() - x.min()
frame.apply(f)

b    2.211685
d    1.952664
e    1.714653
dtype: float64

In [12]:
frame.apply(f, axis=1)

Utah      1.982960
Ohio      1.382301
Texas     0.863761
Oregon    2.256171
dtype: float64

In [14]:
format = lambda x : '%.2f' %x
frame.applymap(format)

            b      d      e
Utah     0.70   0.44  -1.28
Ohio     1.81   0.57   0.43
Texas   -0.40  -0.68  -1.26
Oregon   0.11   1.27  -0.98